print("Task date: 29.11.2023")
print("Task: 3")

"""
Дано три вежі та n дисків різного розміру, відсортованих
за зростанням, розміщених на першій вежі у вигляді піраміди.
Потрібно перемістити всі диски на третю вежу,
використовуючи проміжну вежу, за умови, що можна
переміщати тільки один диск за раз та диск завжди можна
покласти лише на диск більшого розміру або на порожню
вежу.
Ця задача може бути вирішена за допомогою
рекурсивного алгоритму, використовуючи стек для
зберігання проміжних ходів при переміщенні дисків між
вежами.
"""

def hanoi(n, source, target, auxiliary):
    if n == 1:
        print(f"Move disk 1 from {source} to {target}")
        return
    hanoi(n-1, source, auxiliary, target)
    print(f"Move disk {n} from {source} to {target}")
    hanoi(n-1, auxiliary, target, source)

# Example usage
n = 3
hanoi(n, 'A', 'C', 'B')