print("Task date: 27.11.2023")
print("Task: 1")

"""
Користувач вводить з клавіатури набір чисел. Отримані
числа необхідно зберегти до списку (тип списку оберіть в залежності від поставленого нижче завдання). Після чого покажіть меню, в якому запропонуєте користувачеві набір пунктів:
1. Додати нове число до списку (якщо таке число існує у
списку, потрібно вивести повідомлення про це користувачеві без додавання числа).
2. Видалити усі входження числа зі списку (користувач вводить з клавіатури число для видалення)
3. Показати вміст списку (залежно від вибору користувача,
покажіть список з початку або з кінця)
4. Перевірити, чи є значення у списку
5. Замінити значення у списку (користувач визначає, чи
замінити тільки перше входження, чи всі)
Дія виконується залежно від вибору користувача, після
чого меню з’являється знову.
"""

numbers = []

while True:
    print("1. Додати нове число до списку")
    print("2. Видалити усі входження числа зі списку")
    print("3. Показати вміст списку")
    print("4. Перевірити, чи є значення у списку")
    print("5. Замінити значення у списку")

    choice = int(input("Виберіть опцію: "))

    if choice == 1:
        number = int(input("Введіть число: "))
        if number in numbers:
            print("Це число вже існує у списку")
        else:
            numbers.append(number)
    elif choice == 2:
        number = int(input("Введіть число для видалення: "))
        while number in numbers:
            numbers.remove(number)
    elif choice == 3:
        print("1. Показати список з початку")
        print("2. Показати список з кінця")
        show_choice = int(input("Виберіть опцію: "))
        if show_choice == 1:
            print(numbers)
        elif show_choice == 2:
            print(numbers[::-1])
    elif choice == 4:
        number = int(input("Введіть число для перевірки: "))
        if number in numbers:
            print("Це число знаходиться у списку")
        else:
            print("Це число не знаходиться у списку")
    elif choice == 5:
        number = int(input("Введіть число, яке потрібно замінити: "))
        new_number = int(input("Введіть нове число: "))
        replace_all = input("Замінити всі входження? (y/n): ")
        if replace_all.lower() == "y":
            for i in range(len(numbers)):
                if numbers[i] == number:
                    numbers[i] = new_number
        else:
            if number in numbers:
                index = numbers.index(number)
                numbers[index] = new_number